source/tolerant-converter/src/test/resources/convert/convert.in.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
    </soap:Header>
    <soap:Body>
        <ns:ComplexInheritance xmlns:ns="http://k5.eu/tr/model/inheritance"
                               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <!-- before type -->
            <ns:type ns:baseAttribute="baseAttrValue" ns:subAttribute="subAttrValue" xsi:type="ns:SubType">
                <!-- before base value -->
                <ns:baseElement>baseValue</ns:baseElement>
                <!-- before subvalue -->
                <ns:subElement>subValue</ns:subElement>
                <!-- after subvalue -->
            </ns:type>
        </ns:ComplexInheritance>

    </soap:Body>
</soap:Envelope>